package homeWork.homeWork2;

public class Exe6 {
    public static void main(String[] args) {
        /*
        Напишите программу вывода всех четных чисел от 2 до 100
        включительно
        */
        for (int i = 2; i <= 100; i += 2) {
            System.out.println(i);
        }
    }
}
